<?php
/**
 * created by zhang.
 */

namespace App\Helpers;

class ResponseEnum
{
    // -------------------------------------------------------------------------------------------
    // 100开头的表示 信息提示，这类状态表示临时的响应
    // 100 - 继续
    // 101 - 切换协议

    // -------------------------------------------------------------------------------------------
    // 200表示服务器成功地接受了客户端请求
    const HTTP_OK                       = [200, '操作成功'];
    const HTTP_ERROR                    = [201, '操作失败'];

    // -------------------------------------------------------------------------------------------
    // 300开头的表示服务器重定向,指向的别的地方，客户端浏览器必须采取更多操作来实现请求
    // 302 - 对象已移动。
    // 304 - 未修改。
    // 307 - 临时重定向。

    // -------------------------------------------------------------------------------------------
    // 400开头的表示客户端错误请求错误，请求不到数据，或者找不到等等
    // 400 - 错误的请求
    const CLIENT_NOT_FOUND_HTTP_ERROR = [400, '请求失败'];
    const CLIENT_NOT_AUTH = [401, '未授权，请登录后再试'];
    const CLIENT_PARAMETER_ERROR      = [402, '参数错误'];

    // 403 - 禁止访问
    // 404 - 没有找到文件或目录
    const CLIENT_NOT_FOUND_ERROR = [404, '没有找到该页面'];
    // 405 - 用来访问本页面的 HTTP 谓词不被允许（方法不被允许）
    const CLIENT_METHOD_HTTP_TYPE_ERROR = [405, 'HTTP请求类型错误'];
    // 406 - 客户端浏览器不接受所请求页面的 MIME 类型
    // 407 - 要求进行代理身份验证
    // 412 - 前提条件失败
    // 413 – 请求实体太大
    // 414 - 请求 URI 太长
    // 415 – 不支持的媒体类型
    // 416 – 所请求的范围无法满足
    // 417 – 执行失败
    // 423 – 锁定的错误

    // -------------------------------------------------------------------------------------------
    // 500开头的表示服务器错误，服务器因为代码，或者什么原因终止运行
    // 服务端操作错误码：500 ~ 599 开头，后拼接 3 位
    // 500 - 内部服务器错误
    const SYSTEM_ERROR              = [500, '服务器错误'];

    //501 - 页眉值指定了未实现的配置
    //502 - Web 服务器用作网关或代理服务器时收到了无效响应
    //503 - 服务不可用。这个错误代码为 IIS 6.0 所专用
    //504 - 网关超时
    //505 - HTTP 版本不受支持
    // -------------------------------------------------------------------------------------------
}
